#HW4 - SQL

This homework has you working with a new database of information on ticket sales for various types of events.  Your job will be to do some initial exploring and then demonstrate your ability to do all the different types of SQL queries we learned over the last week.  You'll also need to make one function that'll make looking at the tables easier.

These questions are written in the way someone would ask them to you.  In other words, I'm using 'plain english' questions vs. ones where I'm very explicit in terms of what columns and tables to use.  Your exploring of the database and functions to ease that process will come in handy here!  

The database has been created using a set of data from Amazon. You can read more about what each table contains here: https://docs.aws.amazon.com/redshift/latest/dg/c_sampledb.html.

**Submission Instruction**

1- Replace the blank with your name (e.g. DE_HW4-Sara_Riazi)

2- Run your notebook (all the outputs must be visible).

3- Download .ipynb  

4- Submit on Gradescope

## Libraries and import functions

In [1]:
%pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\couga\documents\classes-local\ista-322-fa24\classwork\venv\lib\site-packages (9.4.0)
Note: you may need to restart the kernel to use updated packages.

First bring the libraries we'll need!

In [2]:
import mysql.connector
import pandas as pd

Now bring get_conn_cur and run_query funtions as well as connection information as we used in the practice notebook for SQL (Lab 3)!

In [3]:
#connection
mysql_address = '131.193.32.85'
mysql_username='de_student'
mysql_password='DE_Student_PaSS'

mysql_database = 'my_dataengineering_dbs'

def get_conn_cur():
    cnx = mysql.connector.connect(user=mysql_username, password=mysql_password,
    host=mysql_address,
    database=mysql_database, port='3306');
    return (cnx, cnx.cursor())

In [4]:
#run_query
def run_query(query_string):
    conn, cur = get_conn_cur() 
    cur.execute(query_string) 

    my_data = cur.fetchall()
    result_df = pd.DataFrame(my_data, columns=cur.column_names)

    cur.close()
    conn.close()

    return result_df

## Make a SQL head function - 5 point

Make function to get the pandas equivalent of `.head()`

This function should be called `sql_head` and take a single argument of `table_name` where you specify the table name you want the head information from.  It should return the column names along with the first five rows of the table along.  

**For full points, return a pandas dataframe with this information so it displays nicely :)**

In [7]:
# make sql_head function
def sql_head(table_name):
    qs = """
    SELECT *
    FROM %s
    LIMIT 5
    """ % table_name
    return run_query(qs)

In [8]:
# Check that it works!
sql_head(table_name = 'ticketsdb_sales')

,salesid,listid,sellerid,buyerid,eventid,dateid,qtysold,pricepaid,commission,saletime
0,1,1,36861,21191,7872,1875,4,728.00,109.20,2008-02-17 20:36:48
1,2,4,8117,11498,4337,1983,2,76.00,11.40,2008-06-06 00:00:16
2,3,5,1616,17433,8647,1983,2,350.00,52.50,2008-06-06 03:26:17
3,4,5,1616,19715,8647,1986,1,175.00,26.25,2008-06-09 03:38:52
4,5,6,47402,14115,8240,2069,2,154.00,23.10,2008-08-31 04:17:02

## Explore and SELECT - 5 point

Let's start this homework with some basic queries to get a look at what's in the various tables. Remember that we are using one Database for all schemas in this course. So running "show tables" will list all tables from previous schemas too.
* use run_query first to run "show tables"
* look at the column name, we only wants the tables that starts with 'ticketsdb' which is the schema of this notebook.
* run "show tables where Tables_in_ista322dbs like 'ticketsdb_%' " query using run_query to see all tables for ticketsdb schema.
* Now use the `sql_head()` function you created to get the first five rows of all tables in the ticketsdb schema

In [16]:
ticketsdb_schema = run_query("show tables where Tables_in_my_dataengineering_dbs like 'ticketsdb_%'")
for table in ticketsdb_schema['Tables_in_my_dataengineering_dbs']:
    print(sql_head(table))

   catid catgroup catname                            catdesc
0      1   Sports     MLB            Major League Baseball\n
1      2   Sports     NHL           National Hockey League\n
2      3   Sports     NFL         National Football League\n
3      4   Sports     NBA  National Basketball Association\n
4      5   Sports     MLS              Major League Soccer\n
   dateid     caldate day  week month qtr  year  holiday
0    1827  2008-01-01  WE     1   JAN   1  2008        0
1    1828  2008-01-02  TH     1   JAN   1  2008        0
2    1829  2008-01-03  FR     1   JAN   1  2008        0
3    1830  2008-01-04  SA     2   JAN   1  2008        0
4    1831  2008-01-05  SU     2   JAN   1  2008        0
   eventid  venueid  catid  dateid                    eventname  \
0        1      305      8    1851              Gotterdammerung
1        2      306      8    2114                Boris Godunov
2        3      302      8    1935                       Salome
3        4      309      8    2090  La Cenerentola (Cinderella)
4        5      302      8    1982                 Il Trovatore

            starttime
0 2008-01-25 08:30:00
1 2008-10-15 15:00:00
2 2008-04-19 09:30:00
3 2008-09-21 09:30:00
4 2008-06-05 14:00:00
   listid  sellerid  eventid  dateid  numtickets priceperticket totalprice  \
0       1     36861     7872    1850          10         182.00    1820.00
1       2     16002     4806    1890           7         233.00    1631.00
2       3     21461     4256    2131           2         182.00     364.00
3       4      8117     4337    1970           8          38.00     304.00
4       5      1616     8647    1963           4         175.00     700.00

             listtime
0 2008-01-24 00:43:29
1 2008-03-05 06:25:29
2 2008-11-01 02:35:33
3 2008-05-23 20:18:37
4 2008-05-16 21:29:11
   salesid  listid  sellerid  buyerid  eventid  dateid  qtysold pricepaid  \
0        1       1     36861    21191     7872    1875        4    728.00
1        2       4      8117    11498     4337    1983        2     76.00
2        3       5      1616    17433     8647    1983        2    350.00
3        4       5      1616    19715     8647    1986        1    175.00
4        5       6     47402    14115     8240    2069        2    154.00

  commission            saletime
0     109.20 2008-02-17 20:36:48
1      11.40 2008-06-06 00:00:16
2      52.50 2008-06-06 03:26:17
3      26.25 2008-06-09 03:38:52
4      23.10 2008-08-31 04:17:02
   userid  username firstname  lastname          city state  \
0       1  JSG99FHE    Rafael    Taylor          Kent    WA
1       2  PGL08LJI  Vladimir  Humphrey  Murfreesboro    SK
2       3  IFT66TXU      Lars   Ratliff    High Point    ME
3       4  XDZ38RDD     Barry       Roy         Omaha    AB
4       5  AEB55QTM    Reagan     Hodge   Forest Lake    NS

                                           email           phone  likesports  \
0  Etiam.laoreet.libero@sodalesMaurisblandit.edu  (664) 602-4412           0
1        Suspendisse.tristique@nonnisiAenean.edu  (783) 492-1886           0
2    amet.faucibus.ut@condimentumegetvolutpat.ca  (624) 767-2465           0
3                              sed@lacusUtnec.ca  (355) 452-8168           0
4                               Cum@accumsan.com  (476) 519-9131           0

   liketheatre  likeconcerts  likejazz  likeclassical  likeopera  likerock  \
0            0             0         0              0          0         0
1            0             0         0              0          0         0
2            0             0         0              0          0         0
3            0             0         0              0          0         0
4            0             0         0              0          0         0

   likevegas  likebroadway  likemusicals
0          0             0             0
1          0             0             0
2          0             0             0
3          0             0             0
4          0             0             0
   venueid                  venuename    venuecity venuestate  venueseats
0        1                Toyota Park   Bridgeview         IL           0
1        2      Columbus Crew Stadium     Columbus         OH           0
2        3                RFK Stadium   Washington         DC           0
3        4  CommunityAmerica Ballpark  Kansas City         KS           0
4        5           Gillette Stadium   Foxborough         MA       68756

## WHERE - 5 points

Now let's do a bit of filtering with WHERE.  Write and run queries to get the following results.  
**LIMIT all returns to first five rows.**

* Get venues with >= 10000 seats from the venues table
* Get venues in Arizona
* Get users who have a first name that starts with H
* Get **just email addresses** of users who gave a .edu email address

In [20]:
# Get big venues... so those with >= than 10000 seats
qs = """
    SELECT * FROM ticketsdb_venue
    WHERE venueseats >= 10000
    """
run_query(qs)
# sql_head("ticketsdb_venue")

,venueid,venuename,venuecity,venuestate,venueseats
0,5,Gillette Stadium,Foxborough,MA,68756
1,6,New York Giants Stadium,East Rutherford,NJ,80242
2,15,McAfee Coliseum,Oakland,CA,63026
3,18,Madison Square Garden,New York City,NY,20000
4,67,Ralph Wilson Stadium,Orchard Park,NY,73967
5,68,Rogers Centre,Toronto,ON,50516
6,69,Dolphin Stadium,Miami Gardens,FL,74916
7,70,M&T Bank Stadium,Baltimore,MD,70107
8,71,Paul Brown Stadium,Cincinnati,OH,65535
9,72,Cleveland Browns Stadium,Cleveland,OH,73200
10,73,Heinz Field,Pittsburgh,PA,65050
11,74,Reliant Stadium,Houston,TX,72000
12,75,Lucas Oil Stadium,Indianapolis,IN,63000
13,76,Jacksonville Municipal Stadium,Jacksonville,FL,73800
14,77,LP Field,Nashville,TN,68804
15,78,INVESCO Field,Denver,CO,76125
16,79,Arrowhead Stadium,Kansas City,MO,79451
17,80,Qualcomm Stadium,San Diego,CA,70561
18,81,Texas Stadium,Irving,TX,65595
19,82,Lincoln Financial Field,Philadelphia,PA,68532
20,83,FedExField,Landover,MD,91704
21,84,Soldier Field,Chicago,IL,63000
22,85,Ford Field,Detroit,MI,65000
23,86,Lambeau Field,Green Bay,WI,72922
24,87,Hubert H. Humphrey Metrodome,Minneapolis,MN,64035
25,88,Georgia Dome,Atlanta,GA,71149
26,89,Bank of America Stadium,Charlotte,NC,73298
27,90,Louisiana Superdome,New Orleans,LA,72000
28,91,Raymond James Stadium,Tampa,FL,65647
29,93,Edward Jones Dome,St. Louis,MO,66965
30,94,Monster Park,San Francisco,CA,69843
31,95,Qwest Field,Seattle,WA,67000
32,96,Oriole Park at Camden Yards,Baltimore,MD,48876
33,97,Fenway Park,Boston,MA,39928
34,98,Yankee Stadium,New York City,NY,52325
35,99,Tropicana Field,St. Petersburg,FL,36048
36,100,U.S. Cellular Field,Chicago,IL,40615
37,101,Progressive Field,Cleveland,OH,43345
38,102,Comerica Park,Detroit,MI,41782
39,103,Kauffman Stadium,Kansas City,MO,40793
40,104,Angel Stadium of Anaheim,Anaheim,CA,45050
41,105,Safeco Field,Seattle,WA,47116
42,106,Rangers BallPark in Arlington,Arlington,TX,49115
43,107,Turner Field,Atlanta,GA,50091
44,109,Citizens Bank Park,Philadelphia,PA,43647
45,110,Nationals Park,Washington,DC,41888
46,111,Wrigley Field,Chicago,IL,41118
47,112,Great American Ball Park,Cincinnati,OH,42059
48,113,Minute Maid Park,Houston,TX,40950
49,114,Miller Park,Milwaukee,WI,42200
50,115,PNC Park,Pittsburgh,PA,38496
51,116,Busch Stadium,St. Louis,MO,49660
52,118,Coors Field,Denver,CO,50445
53,119,Dodger Stadium,Los Angeles,CA,56000
54,120,PETCO Park,San Diego,CA,42445
55,121,AT&T Park,San Francisco,CA,41503
56,126,Shoreline Amphitheatre,Mountain View,CA,22000

In [24]:
# Get venues in AZ
qs = """
    SELECT * FROM ticketsdb_venue
    WHERE venuestate = 'AZ'
    """
run_query(qs)

   venueid                      venuename venuecity venuestate  venueseats
0       38              US Airways Center   Phoenix         AZ           0
1       65               Jobing.com Arena  Glendale         AZ           0
2       92  University of Phoenix Stadium  Glendale         AZ           0
3      117                    Chase Field   Phoenix         AZ           0

In [ ]:
#Get users who have a first name that starts with H
qs = """
    SELECT * FROM ticketsdb_users
    WHERE firstname like 'H%'
    """
run_query(qs)
# debugging
# run_query("show tables")
# sql_head("ticketsdb_users")

,userid,username,firstname,lastname,city,state,email,phone,likesports,liketheatre,likeconcerts,likejazz,likeclassical,likeopera,likerock,likevegas,likebroadway,likemusicals
0,13,QTF33MCG,Henry,Cochran,Bossier City,QC,Aliquam.vulputate.ullamcorper@amalesuada.org,(783) 105-0989,0,0,0,0,0,0,0,0,0,0
1,22,RHT62AGI,Hermione,Trevino,Walnut,WI,non.justo.Proin@ametconsectetuer.edu,(245) 110-6540,0,0,0,0,0,0,0,0,0,0
2,29,HUH27PKK,Helen,Avery,Garland,PE,in.faucibus.orci@ultrices.edu,(385) 925-3875,0,0,0,0,0,0,0,0,0,0
3,56,MHU11LZP,Howard,Wiley,Oklahoma City,NU,accumsan@vulputateullamcorper.ca,(277) 315-5682,0,0,0,0,0,0,0,0,0,0
4,67,TWU10MZT,Herman,Myers,Basin,PE,Mauris@neque.com,(471) 895-6189,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2331,49901,CUC69PVF,Hermione,Mcclain,Del Rio,MB,id@Curabitur.org,(242) 264-7006,0,0,0,0,0,0,0,0,0,0
2332,49936,ZKV32TGE,Hop,Mcclain,Saint Cloud,WV,adipiscing@at.org,(930) 289-0793,0,0,0,0,0,0,0,0,0,0
2333,49966,XXT27FBP,Hayden,Wilkinson,Portland,ON,ullamcorper.Duis@pharetra.com,(945) 884-6008,0,0,0,0,0,0,0,0,0,0
2334,49973,KVB52LOX,Harlan,Murphy,Hot Springs,NM,Sed.nulla@nec.ca,(844) 671-5836,0,0,0,0,0,0,0,0,0,0
2335,49988,ERA75TVW,Hayden,Lyons,Chelsea,SC,in@Donecat.ca,(383) 842-2235,0,0,0,0,0,0,0,0,0,0

In [32]:
# Get all .edu email addresses... just the email addresses
qs = """
    SELECT email FROM ticketsdb_users
    WHERE email like '%.edu'
"""
run_query(qs)

                                               email
0      Etiam.laoreet.libero@sodalesMaurisblandit.edu
1            Suspendisse.tristique@nonnisiAenean.edu
2                          ullamcorper.nisl@Cras.edu
3                           vel.est@velitegestas.edu
4                       justo.nec.ante@quismassa.edu
...                                              ...
12472                        nec.orci@adipiscing.edu
12473                                Aliquam@sed.edu
12474                      velit.Aliquam.nisl@ac.edu
12475                                Proin@Class.edu
12476                 urna.Ut@egetdictumplacerat.edu

[12477 rows x 1 columns]

## GROUP BY and HAVING - 5 points

Time to practice some GROUP BY and HAVING operations. Please write and run queries that do the following:

GROUP BY application
* Find the top five venues that hosted the most events: Alias the count of events as 'events_hosted'. Also return the venue ID
* Get the number of events hosted in each month. You'll need to use `date_part()` in your select to select just the months. Alias this as 'month' and then the count of the number of events hosted as 'events_hosted'.
* Get the top five sellers who made the most commission. Alias their total commission made as 'total_com'. Also get their average commission made and alias as 'avg_com'.  Be sure to also display the seller_id.  

HAVING application
* Using the same query as the last one, instead of getting the top five sellers get all sellers who have made a total commission greater than $4000.
* Using the same query as the first groupby, instead of returning the top five venues, return just the ID's of venues that have had greater than 60 events.

In [41]:
### GROUP BY application
# Find the top five venues that hosted the most events: Alias the count of events as 'events_hosted'. Also return the venue ID
qs = """
    SELECT venueid, COUNT(venueid) as events_hosted
    FROM ticketsdb_event
    GROUP BY venueid
    LIMIT 5
"""

run_query(qs)

# run_query("show tables")
# sql_head("ticketsdb_event")

   venueid  events_hosted
0        1             49
1        2             39
2        3             35
3        4             28
4        5             32

In [43]:
# Get the number of events hosted in each month. You'll need to use `month()` in your select to select just the months.
# Alias this as 'month' and then the count of the number of events hosted as 'events_hosted'
qs = """
    SELECT month(starttime) as month, COUNT(venueid) as events_hosted
    FROM ticketsdb_event
    GROUP BY month
"""

run_query(qs)

# run_query("show tables")
# sql_head("ticketsdb_event")

    month  events_hosted
0       1            778
1       2            711
2       3            753
3       4            725
4       5            727
5       6            709
6       7            729
7       8            737
8       9            746
9      10            735
10     11            726
11     12            722

In [50]:
# Get the top five sellers who made the most commission. Alias their total commission made as 'total_com'.
# Also get their average commission made and alias as 'avg_com'. Be sure to also display the seller_id
qs = """
    SELECT sellerid, SUM(commission) as total_com, AVG(commission) as avg_com
    FROM ticketsdb_sales
    GROUP BY sellerid
    LIMIT 5
"""

run_query(qs)

# run_query("show tables")
# sql_head("ticketsdb_sales")

   sellerid total_com     avg_com
0         1    102.45   51.225000
1         2    277.35   34.668750
2         3    267.75   89.250000
3         4    671.10  223.700000
4         5     43.95   14.650000

In [51]:
### HAVING application
# Using the same query as the last groupby, instead of getting the top five sellers get all sellers who have made a total commission greater than $4000
qs = """
    SELECT sellerid, SUM(commission) as total_com, AVG(commission) as avg_com
    FROM ticketsdb_sales
    GROUP BY sellerid
    HAVING total_com > 4000
"""

run_query(qs)

# run_query("show tables")
# sql_head("ticketsdb_sales")

   sellerid total_com     avg_com
0      1140   4859.85  347.132143
1      2372   4073.85  678.975000
2     13385   4274.25  388.568182
3     25433   4147.95  518.493750
4     43551   4704.75  470.475000

In [52]:
# Using the same query as the first groupby, instead of returning the top five venues, return just the ID's of venues that have had greater than 60 events
qs = """
    SELECT venueid, COUNT(venueid) as events_hosted
    FROM ticketsdb_event
    GROUP BY venueid
    HAVING events_hosted > 60
"""

run_query(qs)

# run_query("show tables")
# sql_head("ticketsdb_event")

    venueid  events_hosted
0       201             62
1       203             80
2       205             70
3       207             67
4       208             69
5       209             66
6       215             62
7       216             72
8       217             81
9       218             70
10      220             81
11      221             61
12      222             74
13      226             71
14      228             63
15      237             64
16      238             68
17      239             63
18      243             69
19      248             67

## JOIN - 5 points

Time for some joins. You've probably noticed by now that there is at least one relational key in each table, but some have more.  For example, sales has a unique sale id, listing id, seller id, buyer id, date id.  This allows you to link each sale to relevant information in other tables.  

Please write queries to do the following items:

* Join information of users to each sale made (using seller id).  
* Join information about each venue to each event.

In [ ]:
# Join users information to each sale using seller id (correct solution has 172456 rows)
qs = """
    SELECT s.sellerid, u.*
    FROM ticketsdb_sales s
    JOIN ticketsdb_users u
    ON s.sellerid = u.userid
"""

run_query(qs)

# run_query("show tables")
# sql_head("ticketsdb_users")

In [ ]:
# For each event attach the venue information (correct solution has 8659 rows)

## Subqueries - 5 points

To wrap up let's do several subqueries. Please do the following:

* Get all purchases made by users of live in Arizona
* Get event information for all events that took place in a venue where the venue name ends with 'Stadium'.
* Get event information for all events where the total ticket sales were greater than $50,000.

In [ ]:
# Get all purchases from users who live in Arizona (correct solution has 1855 rows)

In [ ]:
# Get event information for all events that took place in a venue where the name ended in 'Stadium' (correct solution has 1029 rows)

In [ ]:
# Get event name where the total sales for that event were greater than $50000 (correct solution has three rows for Adriana Lecouvreur,Phantom of the Opera, and Janet Jackson )
# Note that we are looking for  event name!